Tekla.Structures.ModelInternal.dotRebarThreading_t
The rebar threading struct.

Tekla.Structures.ModelInternal.dotRebarThreading_t.ThreadingType
The threading type.

Tekla.Structures.ModelInternal.dotRebarThreading_t.Length
The length.

Tekla.Structures.ModelInternal.dotRebarThreading_t.ExtraFabLength
The extra fab length.

Tekla.Structures.ModelInternal.dotRebarThreading_t.StringSize
The string size.